[  
   {  
      "quote":"“Happy labor day... Enjoy it.”",
      "author":"Tweeted by Lakers small forward Metta World Peace on Memorial Day, 2012."
   },
   {  
      "quote":"“People think we make $3 million and $4 million a year. They don’t realize that most of us only make $500,000.\",",
      "author":"Pete Incaviglia, former Texas Rangers outfielder on why baseball players aren’t overpaid."
   },
   {  
      "quote":"“That’s part of the challenge of being a professional athlete.”",
      "author":"Former Houston Rockets backup center John Amaechi on not receiving a single minute of playing time during the season."
   },
   {  
      "quote":"“Hawaii doesn’t win many games in the United States.”",
      "author":"ESPN analyst Lee Corso on the University of Hawaii’s poor record against teams in mainland America."
   },
   {  
      "quote":"“Therapy can be a good thing; it can be therapeutic.\",",
      "author":"Alex Rodriguez, New York Yankees third baseman."
   },
   {  
      "quote":"“The game was closer than the score indicated.”",
      "author":"MLB Hall of Fame pitcher Dizzy Dean after a 1-0 game."
   },
   {  
      "quote":"“Well, either side could win it, or it could be a draw.”",
      "author":"Ron Atkinson, former soccer player and television pundit."
   },
   {  
      "quote":"“I’m tellin’ ya man, to be able to stroke it like that must be some kind of feeling.”",
      "author":"Dick Vitale on J.J. Redick’s three-point shooting."
   },
   {  
      "quote":"Seattle Seahawks wide receiver Steve Largent explained which of his records he’ll cherish the most after retiring from football:",
      "author":"“Probably the Beatles’ White Album.”"
   },
   {  
      "quote":"“I think that’s my biggest key in my workout... with swimming and weights... is like my weight room.\"",
      "author":"Ryan Lochte, Olympic swimmer and weight room appreciator."
   },
   {  
      "quote":"“Aw, how could he lose the ball in the sun? He’s from Mexico.”",
      "author":"Former Cubs announcer Harry Caray on Jorge Orta losing track of a fly ball."
   },
   {  
      "quote":"“It’s humbling being humble.”",
      "author":"Maurice Clarett, former Denver Broncos running back."
   },
   {  
      "quote":"“That’s all they said was wrong with me?”",
      "author":"Former heavyweight champ Mike Tyson responding to questions about him suffering from depression, low self-esteem and problems with anger management."
   },
   {  
      "quote":"“Saltwater taffy.”",
      "author":"Former NBA big man Caldwell Jones on his favorite seafood."
   },
   {  
      "quote":"“Why should we have to go to class if we came here to play FOOTBALL, we ain’t come to play SCHOOL, classes are POINTLESS.”",
      "author":"Tweet sent out by Ohio State backup quarterback Cardale Jones."
   },
   {  
      "quote":"“Chemistry is a class you take in high school or college, where you figure out two plus two is 10 or something.”",
      "author":"Dennis Rodman explaining team chemistry. "
   },
   {  
      "quote":"“It ain’t the heat. It’s the humility.”",
      "author":"Yankee legend Yogi Berra"
   },
   {  
      "quote":"“It’s permanent, for now.”",
      "author":"Former MLB outfielder Roberto Kelly on whether or not he would change his nickname “Bobby” in the future. "
   },
   {  
      "quote":"“They throw [Dave] Winfield out at second—and he’s safe.”",
      "author":"San Diego Padres broadcaster Jerry Coleman"
   },
   {  
      "quote":"“That picture was taken out of context.”",
      "author":"New York Mets pitcher Jeff Innis on a photo of him that he believed made him look goofy."
   },
   {  
      "quote":"“We’re leaving a big fat rail of coke and a shot of Jack for Santa this year... cookies and milk will just slow him down. #SimpleTruth”",
      "author":"Tweet by Patriots linebacker Brandon Spikes this past holiday season."
   },
   {  
      "quote":"“I guess that makes our biggest weakness lack of strength.”",
      "author":"Gene Stallings, Texas A&M football coach after hearing TCU head coach Abe Martin claim his team’s biggest strength is its lack of weakness."
   },
   {  
      "quote":"“I believe I am more intelligent than the average person. There are few people with such talent, so there are few able to judge what I am doing.”",
      "author":"Italian footballer Mario Balotelli on his past antics involving dart-throwing at youth league players and sneaking into a women’s prison."
   },
   {  
      "quote":"“You can sum up this sport in two words: You never know.”",
      "author":"Boxing trainer Lou Duva."
   },
   {  
      "quote":"After being asked what he had gotten out of his rookie season in the league, former MLB outfielder Hensley Meulens replied:",
      "author":"“Oh, $120,000.”"
   },
   {  
      "quote":"“I just got caught up in the moment, and, oh well.”",
      "author":"U.S. snowboarder Lindsey Jacobellis to NBC’s Bob Costas. Jacobellis had just lost the 2006 gold medal for snowboardcross after botching a trick and falling down yards from the finish line."
   },
   {  
      "quote":"“I feel like I’m the best, but you’re not going to get me to say that.”",
      "author":"NFL legend Jerry Rice"
   },
   {  
      "quote":"“Yo soy fiesta!”",
      "author":"Patriots tight end Rob Gronkowski in response to an ESPN Deportes reporter’s questions about how he plans to celebrate a win over the Baltimore Ravens."
   },
   {  
      "quote":"“They always put the smart guys out in right field. That’s where I used to play.”",
      "author":"Former MLB slugger Jose Canseco"
   },
   {  
      "quote":"“I feel very Dominican.”",
      "author":"Alex Rodriguez on which nation he would play for in the first World Baseball Classic."
   },
   {  
      "quote":"“When you’re rich you don’t write checks... straight cash, homey.”",
      "author":"Randy Moss when asked how he’ll pay an NFL fine for unsportsmanlike celebration."
   },
   {  
      "quote":"Former Seattle SuperSonics center Jerome James explained his personal views on coach Nate McMillan calling him selfish with this little ditty:",
      "author":"“I don’t have the first clue who he is talking about, because all I worry about is Jerome.”"
   },
   {  
      "quote":"“Gaylord Perry and Willie McCovey should know each other like a book. They’ve been ex-teammates for years now.”",
      "author":"Jerry Coleman, San Diego Padres broadcaster "
   },
   {  
      "quote":"“It was no Mozart.”",
      "author":"Bill Cowher after a tough victory on the gridiron. "
   },
   {  
      "quote":"“It may not impress you, but Holtz means ‘hard wood.’”",
      "author":"Former college football coach and television analyst Lou Holtz."
   },
   {  
      "quote":"“We must have had 99 percent of the match. It was the other three percent that cost us.”",
      "author":"Dutch soccer manager Ruud Gullit"
   },
   {  
      "quote":"“Sam is an idiot—I-D-O-U-T—idiot.”",
      "author":"Shaquille O’Neal on Chicago Tribune writer Sam Smith, who wrote an article suggesting the Miami Heat rid themselves of \"The Big Aristotle.\","
   },
   {  
      "quote":"“Don’t say I don’t get along with my teammates. I just don’t get along with some of the guys on my team.”",
      "author":"Former NFL wide receiver Terrell Owens"
   },
   {  
      "quote":"“He’s the Man of the Hour, at this particular moment.”",
      "author":"Boxing promoter Don King"
   },
   {  
      "quote":"Former San Francisco Giants coach Rocky Bridges was asked why he refused to eat snails, to which he responded:",
      "author":"“I prefer fast food.”"
   },
   {  
      "quote":"“It’s going to be about me.”",
      "author":"Former NFL great Lawrence Taylor describing the autobiography he planned to write."
   },
   {  
      "quote":"“I’m not an athlete. I’m a professional baseball player.”",
      "author":"Former MLB first baseman and television analyst John Kruk"
   },
   {  
      "quote":"“I’ve only scratched the iceberg.”",
      "author":"Tennis great Andre Agassi assessing his talent ceiling in 1990."
   },
   {  
      "quote":"After being asked about her love life during a promotional event for a line of undergarments she endorses, former tennis star Anna Kournikova had this to say:",
      "author":"“I’m not here to talk about my personal life. I’m here to talk about bras.” "
   },
   {  
      "quote":"After hearing an unproductive member of the team had been traded away, Philadelphia Phillies outfielder Lenny Dykstra reacted with:",
      "author":"“Great trade! Who did we get?”"
   },
   {  
      "quote":"“Raise the urinals.”",
      "author":"Former backup shortstop Darrel Chaney’s advice on how the front office can keep the Braves on their toes. "
   },
   {  
      "quote":"“Michael Jordan is probably the greatest scorer to ever play in the game. But I may go so far to say LeBron James may be the greatest player to ever play the game.”",
      "author":"Scottie Pippen"
   },
   {  
      "quote":"“Yankees pitchers have had great success against Cabrera when they get him out.”",
      "author":"Former MLB catcher and current sportscaster Tim McCarver"
   },
   {  
      "quote":"“He might’ve won the war, but the battle’s not over.”",
      "author":"NFL running back Cadillac Williams on getting picked later in 2005 draft than his Auburn teammate Ronnie Brown."
   },
   {  
      "quote":"“The word genius isn’t applicable in football. A genius is a guy like Norman Einstein.”",
      "author":"Former Washington Redskins quarterback Joe Theisman"
   },
   {  
      "quote":"“Ninety percent of this game is half mental.”",
      "author":"Yankess legend Yogi Berra"
   },
   {  
      "quote":"“The only thing that keeps this organization from being recognized as one of the finest in baseball is wins and losses at the major league level.",
      "author":"Chuck Lamar, former Tampa Bay Devil Rays manager"
   },
   {  
      "quote":"“What defines me? ...Ryan Lochte.”",
      "author":"Ryan Lochte, Olympic swimmer and horrendous interviewee"
   },
   {  
      "quote":"“I’m traveling to all 51 states to see who can stop 85.”",
      "author":"Former NFL wide receiver Chad Johnson"
   },
   {  
      "quote":"“My career was sputtering until I did a 360 and got headed in the right direction.”",
      "author":"Former Orlando Magic star Tracy McGrady"
   },
   {  
      "quote":"“We’re going to turn this team around 360 degrees.”",
      "author":"New York Knicks guard Jason Kidd after being drafted by the Dallas Mavericks."
   },
   {  
      "quote":"“I’m rich. What am I supposed to do? Hide it?”",
      "author":"Former Detroit Tigers second baseman Lou Whitaker, after showing up to a players’ union meeting in a stretch limousine."
   },
   {  
      "quote":"“We’ll do all right if we can capitalize on our mistakes.”",
      "author":"Mickey Rivers, former MLB designated hitter"
   },
   {  
      "quote":"“Sometimes they write what I say, not what I mean.”",
      "author":"Pedro Guerrero, former MLB baseball player"
   },
   {  
      "quote":"“It’s war. They’re out there to kill you, so I’m out there to kill them. We don’t care about nobody but this U... I’m a soldier!”",
      "author":"University of Miami tight end Kellen Winslow after a loss to Tennessee in 2003"
   },
   {  
      "quote":"“I ain’t gonna be no escape-goat!”",
      "author":"NBA Hall of Famer Karl Malone"
   },
   {  
      "quote":"Sportscaster Tim McCarver on increased home run rates in the MLB:",
      "author":"“It has not been proven, but I think it will be proven that the air is thinner now, there have been climactic changes over the last 50 years in the world, and I think that’s one of the reasons balls are carrying much better now than I remember.”"
   },
   {  
      "quote":"“It’s not going to be peaches and gravy all the time.”",
      "author":"Former Indiana Pacers center Brad Miller showcasing an interesting palate when he described the team’s struggles to reporters. "
   },
   {  
      "quote":"“Son, looks to me like you’re spending too much time on one subject.\"",
      "author":"Former Texas A&M basketball coach Shelby Metcalf explaining what he told one of his players who received four F’s and one D on his report card."
   },
   {  
      "quote":"“Because there are no fours.”",
      "author":"Former NBA power forward Antoine Walker on why he shoots so many three-pointers."
   },
   {  
      "quote":"“I dunno. I never smoked any Astroturf.\"",
      "author":"Former Philly Tug McGraw on whether he preferred grass or Astroturf."
   },
   {  
      "quote":"“It’s almost like we have ESPN or something.”",
      "author":"Lakers great Magic Johnson on how he and teammate James Worthy always work so well together on the basketball court. "
   },
   {  
      "quote":"“Rice defends against the free throw as well as anybody I’ve seen.”",
      "author":"Former Texas A&M basketball coach Shelby Metcalf"
   },
   {  
      "quote":"“I’ve got my family to feed.”",
      "author":"Former NBA swingman Latrell Sprewell on why he wanted to sign a contract extension or be traded after making $14.6 million during the 2004-05 season."
   },
   {  
      "quote":"\"Surprise me.”",
      "author":"Yankees legend Yogi Berra on where his wife should bury him."
   },
   {  
      "quote":"\"I PRAISE YOU 24/7!!!!!! AND THIS HOW YOU DO ME!!!!! YOU EXPECT ME TO LEARN FROM THIS??? HOW???!!! ILL NEVER FORGET THIS!! EVER!!! THX THO...\"",
      "author":"Buffalo Bills wide receiver Stevie Johnson tweeted this message, presumably to the creator of the universe, after dropping a game-winning catch in 2010."
   },
   {  
      "quote":"“I may be dumb, but I’m not stupid.”",
      "author":"Former NFL great and current NFL analyst Terry Bradshaw."
   },
   {  
      "quote":"“He treats us like men. He lets us wear earrings.”",
      "author":"Former University of Houston wide receiver Torrin Polk on former coach John Jenkins"
   },
   {  
      "quote":"Former MLB outfielder and base-stealing extraordinaire Rickey Henderson on a writer’s claim that 50 percent of major league baseball players use steroids:",
      "author":"“Well, I’m not one of them. So that’s 49 percent right there.\","
   },
   {  
      "quote":"“I’ve had to overcome a lot of diversity.”",
      "author":"Drew Gooden, Milwaukee Bucks forward-center"
   },
   {  
      "quote":"“I’m very appreciative of being indicted.”",
      "author":"Former Florida State football coach Bill Peterson on being inducted into the Florida Hall of Fame."
   },
   {  
      "quote":"“I’m a four-wheel-drive pickup type of guy, and so is my wife.”",
      "author":"Former Red Sox outfielder Mike Greenwell"
   },
   {  
      "quote":"When San Francisco Giants fans began chanting “Barry! Barry! Barry!” for Giants pitcher Barry Zito in Game 1 of the 2012 World series, broadcaster Joe Buck set up fellow sportscaster Tim McCarver for an easy home run:",
      "author":"“They used to say [Barry] for somebody else around here,” said Buck. “When Barry Manilow was playing in a concert,” replied McCarver. “Or Barry Bonds,” said Buck, incredulous."
   },
   {  
      "quote":"“Better make it six. I can’t eat eight.”",
      "author":"Former MLB pitcher Dan Osinski after a waitress asked him if he wanted his pizza cut into six slices or eight. "
   },
   {  
      "quote":"“I’m just happy that Jesus Christ did not let me lose my teeth when I was 20-years-old.”",
      "author":"Lakers small forward Metta World Peace when asked how his teammates were reacting to his name change."
   },
   {  
      "quote":"“I want to rush for 1,000 or 1,500 yards—whichever comes first.”",
      "author":"South Carolina Heisman Trophy winner George Rogers"
   },
   {  
      "quote":"“We didn’t underestimate them. They were a lot better than we thought.”",
      "author":"Former English football manager Bobby Robson, on narrowly surviving a game against Cameroon in the 1990 World Cup."
   },
   {  
      "quote":"“They shouldn’t throw at me. I’m the father of five or six kids.”",
      "author":"Former MLB player Tito Fuentes on getting hit by pitches. "
   },
   {  
      "quote":"\"There someone warming up in the bullpen, but he's obscured by his number.\"",
      "author":"Jerry Coleman, San Diego Padres broadcaster"
   },
   {  
      "quote":"“He’s a guy who gets up at six o’clock in the morning regardless of what time it is.”",
      "author":"Lou Duva on the rigorous training regimen of heavyweight Andrew Golota."
   },
   {  
      "quote":"“I don’t think anyone on this team knows what ‘schism’ is, let alone could use it in a sentence. I thought it was an STD when I first heard it and was like ‘whoa, we preach abstinence in these parts.’\"",
      "author":"Vikings defensive end Jared Allen said this about the possibility of a hostile “schism” growing in the locker room between teammates."
   },
   {  
      "quote":"“I owe a lot to my parents, especially my mother and father.”",
      "author":"Professional golfer Greg Norman"
   },
   {  
      "quote":"“It isn’t like I came down from Mount Sinai with the tabloids.”",
      "author":"Former Indianapolis Colts head coach Ron Meyer, on whether or not he made the right decision by starting rookie quarterback Jeff George. "
   },
   {  
      "quote":"“I can shoot with my left hand, I can shoot with my right hand. I’m amphibious.”",
      "author":"Charles Shackleford, former NBA forward "
   },
   {  
      "quote":"Brother Ray Page, a teacher at St. Anthony High School in Jersey City, N.J., claims he once had to explain a geographical conundrum to his student, Bobby Hurley, who would go on to play for the Sacramento Kings:",
      "author":"“[Bobby Hurley] once asked me if Beirut was named after that famous baseball player who hit home runs.” "
   },
   {  
      "quote":"“We do the same things here.”",
      "author":"Former Chicago Bulls star Dennis Rodman on North Korean dictator Kim Jung Un using prison camps to punish alleged criminals. "
   },
   {  
      "quote":"“My sister’s expecting a baby, and I don’t know if I’m going to be an aunt or an uncle.”",
      "author":"NC State basketball player Chuck Nevitt explaining to his coach why he appeared nervous during practice."
   },
   {  
      "quote":"“Anyone with knowledge of the slave trade and the NFL could say that these two parallel each other.”",
      "author":"Pittsburgh Steelers running back Rashard Mendenhall tweeted this nugget of historical wisdom in 2011. "
   },
   {  
      "quote":"“I want all the kids to copulate me.\"",
      "author":"Chicago Cubs Hall of Famer Andre Dawson on being a role model for children."
   },
   {  
      "quote":"“Fade into Bolivian, I guess.”",
      "author":"Former heavyweight champ Mike Tyson on what he would do after retiring from boxing. "
   },
   {  
      "quote":"“We’re not attempting to circumcise the rules.”",
      "author":"Former Steelers head coach Bill Cowher "
   },
   {  
      "quote":"Never one to hold back on the crazy, Jose Canseco unleashed these dinosaur/physics related tweets on his followers earlier this month:",
      "author":"“Ancient gravity was much weaker...\"“Gravity had to be weaker to make dinosaurs nimble.” "
   },
   {  
      "quote":"“The Bible never says anything about dinosaurs. You can't say there were dinosaurs when you never saw them. Someone actually saw Adam and Eve. No one ever saw a Tyrannosaurus Rex.\"",
      "author":"Former MLB outfielder Carl Everett"
   },
   {  
      "quote":"“The sun has been there for 500, 600 years.”",
      "author":"Former MLB outfielder Mike Cameron"
   },
   {  
      "quote":"“I can’t really remember the names of the clubs that we went to.”",
      "author":"Shaquille O’Neal’s response to whether or not he had stopped at the Parthenon while in Greece."
   }
]